%% ПРИМЕР: Изчисляване на собствени и взаимни проводимости на едномашинна ЕЕС
clear all; clc;
fprintf('ПРИМЕР: Изчисляване на собствени и взаимни проводимости на едномашинна ЕЕС\n\n')

%% Входни данни
% трансформатор
ZT = 0.15i; % pu

% товар
ZB = 11.11; % pu

% електропроводи
ZW1 = 0.0225 + 0.225i;
YW1 = 0.11i;

ZW2 = 0.0225 + 0.225i;
YW2 = 0.11i;

ZW3 = 0.0225 + 0.225i;
YW3 = 0.11i;

ZW4 = 0.0225 + 0.225i;
YW4 = 0.11i;

%% а) Метод на преобразуването на схемата, при пренебрегнати напречни проводимости на електропроводите
fprintf('a) Метод на преобразуването на схемата, при пренебрегнати напречни проводимости на електропроводите\n')

% Паралелно свързване на W1 и W2
ZW12 = ZW1*ZW2 / (ZW1 + ZW2);

% Паралелно свързване на W3 и W4
ZW34 = ZW3*ZW4 / (ZW3 + ZW4);

