% Скрипт за формиране на собствените и взаимни проводимости с включен
% импеданс на генератора към тях за целите на Example_03.m

clear all; clc
%% Входни данни
% генератор
Xd_prim  = 0.3;
Ra       = 0.0;
ZG       = Ra + 1i*Xd_prim;

% трансформатор
ZT = 0.15i; % pu

% товар
ZB = 11.11; % pu

% електропроводи
ZW1 = 0.0225 + 0.225i;
YW1 = 0.11i;

ZW2 = 0.0225 + 0.225i;
YW2 = 0.11i;

ZW3 = 0.0225 + 0.225i;
YW3 = 0.11i;

ZW4 = 0.0225 + 0.225i;
YW4 = 0.11i;

%% Метод с редуциране матрицата на възловите проводимости, при отчитане на напречните проводимости на електропроводите
fprintf('\nМетод с редуциране матрицата на възловите проводимости, при отчитане\n   напречните проводимости на електропроводите\n')

% Формиране на матриците на проводимостите на отделните елементи
MW1 = [ (1/ZW1 + YW1/2),         -1/ZW1;
        -1/ZW1,          (1/ZW1 + YW1/2)
    ];

MW2 = [ (1/ZW2 + YW2/2),         -1/ZW2;
        -1/ZW2,          (1/ZW2 + YW2/2)
    ];

MW3 = [ (1/ZW3 + YW3/2),         -1/ZW3;
        -1/ZW3,          (1/ZW3 + YW3/2)
    ];

MW4 = [ (1/ZW4 + YW4/2),         -1/ZW4;
        -1/ZW4,          (1/ZW4 + YW4/2)
    ];

MT = [ 1/ZT, -1/ZT;
       -1/ZT,  1/ZT;
    ];

MG = [ 1/ZG, -1/ZG;
       -1/ZG,  1/ZG;
    ];

% Формиране на матрицата на проводимостите на мрежата
% с размери 5х5, според броя възлите в нея, като вътрешния генераторен
% възел се приема за номер 5
Y = zeros(5,5);

% Включваме в нея T
bus1 = 1;
bus2 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + MT(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MT(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MT(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MT(2,1);

% Включваме в нея W1
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW1(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW1(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW1(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW1(2,1);

% Включваме в нея W2
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW2(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW2(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW2(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW2(2,1);

% Включваме в нея W3
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW3(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW3(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW3(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW3(2,1);

% Включваме в нея W4
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW4(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW4(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW4(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW4(2,1);

% Включваме в нея B
bus1 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + 1/ZB;

% Включваме в нея Г
bus1 = 1;
bus2 = 5;
Y(bus1,bus1) = Y(bus1,bus1) + MG(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MG(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MG(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MG(2,1);

fprintf('Матрица с проводимостите на мрежата')
Y

% Извличаме нейните подматрици и с тях изчисляваме
% редуцираната матрица с проводимостите на мрежата,
% в която присъстват само възли 1 и 2
bus_G = [2 5];
bus_B = [1 3 4];

YGG = Y(bus_G, bus_G);
YGB = Y(bus_G, bus_B);
YBG = Y(bus_B, bus_G);
YBB = Y(bus_B, bus_B);

fprintf('Редуцираната матрица с възловите проводимости е')
YG = YGG - YGB*inv(YBB)*YBG

% От редуцираната матрица извличаме собствените и взаимни
% проводимости на двата генераторни клона
% Собствени проводимости
fprintf('Собствени проводимости:\n')
Y11g = YG(2,2);
fprintf('Y11g  = %0.4f %+0.4fi \n', real(Y11g), imag(Y11g))

Y22g = YG(1,1);
fprintf('Y22g  = %0.4f %+0.4fi \n', real(Y22g), imag(Y22g))

% Взаимни проводимости
fprintf('Взаимни проводимости:\n')
Y12g = -YG(1,2);

fprintf('Y12g  = %0.4f %+0.4fi \n', real(Y12g), imag(Y12g))
Y21g = -YG(2,1);
fprintf('Y21g  = %0.4f %+0.4fi \n', real(Y21g), imag(Y21g))