%% ПРИМЕР: Изчисляване на собствени и взаимни проводимости на едномашинна ЕЕС
clear all; clc;
fprintf('ПРИМЕР: Изчисляване на собствени и взаимни проводимости на едномашинна ЕЕС\n\n')

%% Входни данни
% трансформатор
ZT = 0.15i; % pu

% товар
ZB = 11.11; % pu

% електропроводи
ZW1 = 0.0225 + 0.225i;
YW1 = 0.11i;

ZW2 = 0.0225 + 0.225i;
YW2 = 0.11i;

ZW3 = 0.0225 + 0.225i;
YW3 = 0.11i;

ZW4 = 0.0225 + 0.225i;
YW4 = 0.11i;

%% а) Метод на преобразуването на схемата, при пренебрегнати напречни проводимости на електропроводите
fprintf('a) Метод на преобразуването на схемата, при пренебрегнати\n   напречни проводимости на електропроводите\n')

% Паралелно свързване на W1 и W2
ZW12 = ZW1*ZW2 / (ZW1 + ZW2);
fprintf('ZW12 = %0.4f %+0.4fi \n', real(ZW12), imag(ZW12))

% Паралелно свързване на W3 и W4
ZW34 = ZW3*ZW4 / (ZW3 + ZW4);
fprintf('ZW34 = %0.4f %+0.4fi \n', real(ZW34), imag(ZW34))

% Последователно свързване на двата еквивалентни електропровода
% при което се елиминира възел 4
ZW = ZW12 + ZW34;
fprintf('ZW   = %0.4f %+0.4fi \n', real(ZW), imag(ZW))

% Елиминиране и на възел 3 чрез преобразуване от
% звезда в триъгълник
Z12 = ZT + ZW + ZT*ZW/ZB;
fprintf('Z12  = %0.4f %+0.4fi \n', real(Z12), imag(Z12))

Z10 = ZT + ZB + ZT*ZB/ZW;
fprintf('Z10  = %0.4f %+0.4fi \n', real(Z10), imag(Z10))

Z20 = ZW + ZB + ZW*ZB/ZT;
fprintf('Z20  = %0.4f %+0.4fi \n', real(Z20), imag(Z20))

% Собствени проводимости
fprintf('Собствени проводимости:\n')
Y11 = 1/Z12 + 1/Z10;
fprintf('Y11  = %0.4f %+0.4fi \n', real(Y11), imag(Y11))
Y22 = 1/Z12 + 1/Z20;
fprintf('Y22  = %0.4f %+0.4fi \n', real(Y22), imag(Y22))

% Взаимни проводимости
fprintf('Взаимни проводимости:\n')
Y12 = 1/Z12;
fprintf('Y12  = %0.4f %+0.4fi \n', real(Y12), imag(Y12))
Y21 = 1/Z12;
fprintf('Y21  = %0.4f %+0.4fi \n', real(Y21), imag(Y21))

%% b) Метод с редуциране матрицата на възловите проводимости, при пренебрегнати напречни проводимости на електропроводите
fprintf('\nb) Метод с редуциране матрицата на възловите проводимости, при пренебрегнати\n   напречни проводимости на електропроводите\n')

% Формиране на матриците на проводимостите на отделните елементи
MW1 = [ 1/ZW1, -1/ZW1;
        -1/ZW1,  1/ZW1
       ];
fprintf('Възлова матрица на W1')
MW1

MW2 = [ 1/ZW2, -1/ZW2;
        -1/ZW2,  1/ZW2
       ];
fprintf('Възлова матрица на W2')
MW2

MW3 = [ 1/ZW3, -1/ZW3;
        -1/ZW3,  1/ZW3
       ];
fprintf('Възлова матрица на W3')
MW3

MW4 = [ 1/ZW4, -1/ZW4;
        -1/ZW4,  1/ZW4
       ];
fprintf('Възлова матрица на W4')
MW4

MT = [ 1/ZT, -1/ZT;
       -1/ZT,  1/ZT;
      ];
fprintf('Възлова матрица на T')
MW1

% Формиране на матрицата на проводимостите на мрежата
% с размери 4х4, според броя възлите в нея
Y = zeros(4,4);

% Включваме в нея T
bus1 = 1;
bus2 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + MT(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MT(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MT(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MT(2,1);

% Включваме в нея W1
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW1(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW1(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW1(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW1(2,1);

% Включваме в нея W2
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW2(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW2(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW2(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW2(2,1);

% Включваме в нея W3
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW3(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW3(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW3(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW3(2,1);

% Включваме в нея W4
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW4(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW4(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW4(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW4(2,1);

% Включваме в нея B
bus1 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + 1/ZB;

fprintf('Матрица с проводимостите на мрежата')
Y

% Извличаме нейните подматрици и с тях изчисляваме
% редуцираната матрица с проводимостите на мрежата,
% в която присъстват само възли 1 и 2
bus_G = [1 2];
bus_B = [3 4];
fprintf('И нейните подматрици')
YGG = Y(bus_G, bus_G)
YGB = Y(bus_G, bus_B)
YBG = Y(bus_B, bus_G)
YBB = Y(bus_B, bus_B)

fprintf('Редуцираната матрица с възловите проводимости е')
YG = YGG - YGB*inv(YBB)*YBG

% От редуцираната матрица извличаме собствените и взаимни
% проводимости на двата генераторни клона
% Собствени проводимости
fprintf('Собствени проводимости:\n')
Y11 = YG(1,1);
fprintf('Y11  = %0.4f %+0.4fi \n', real(Y11), imag(Y11))
Y22 = YG(2,2);
fprintf('Y22  = %0.4f %+0.4fi \n', real(Y22), imag(Y22))

% Взаимни проводимости
fprintf('Взаимни проводимости:\n')
Y12 = -YG(1,2);
fprintf('Y12  = %0.4f %+0.4fi \n', real(Y12), imag(Y12))
Y21 = -YG(2,1);
fprintf('Y21  = %0.4f %+0.4fi \n', real(Y21), imag(Y21))

%% c) Метод с редуциране матрицата на възловите проводимости, при отчитане на напречните проводимости на електропроводите
fprintf('\nc) Метод с редуциране матрицата на възловите проводимости, при отчитане\n   напречните проводимости на електропроводите\n')

% Формиране на матриците на проводимостите на отделните елементи
MW1 = [ (1/ZW1),        -(1/ZW1 + YW1/2);
    -(1/ZW1 + YW1/2), (1/ZW1)
    ];
fprintf('Възлова матрица на W1')
MW1

MW2 = [ (1/ZW2),        -(1/ZW2 + YW2/2);
    -(1/ZW2 + YW2/2), (1/ZW2)
    ];
fprintf('Възлова матрица на W2')
MW2

MW3 = [ (1/ZW3),        -(1/ZW3 + YW3/2);
    -(1/ZW3 + YW3/2), (1/ZW3)
    ];
fprintf('Възлова матрица на W3')
MW3

MW4 = [ (1/ZW4),        -(1/ZW4 + YW4/2);
    -(1/ZW4 + YW4/2), (1/ZW4)
    ];
fprintf('Възлова матрица на W4')
MW4

MT = [ 1/ZT, -1/ZT;
       -1/ZT,  1/ZT;
    ];
fprintf('Възлова матрица на T')
MT

% Формиране на матрицата на проводимостите на мрежата
% с размери 4х4, според броя възлите в нея
Y = zeros(4,4);

% Включваме в нея T
bus1 = 1;
bus2 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + MT(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MT(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MT(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MT(2,1);

% Включваме в нея W1
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW1(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW1(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW1(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW1(2,1);

% Включваме в нея W2
bus1 = 3;
bus2 = 4;
Y(bus1,bus1) = Y(bus1,bus1) + MW2(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW2(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW2(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW2(2,1);

% Включваме в нея W3
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW3(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW3(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW3(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW3(2,1);

% Включваме в нея W4
bus1 = 4;
bus2 = 2;
Y(bus1,bus1) = Y(bus1,bus1) + MW4(1,1);
Y(bus2,bus2) = Y(bus2,bus2) + MW4(2,2);
Y(bus1,bus2) = Y(bus1,bus2) + MW4(1,2);
Y(bus2,bus1) = Y(bus2,bus1) + MW4(2,1);

% Включваме в нея B
bus1 = 3;
Y(bus1,bus1) = Y(bus1,bus1) + 1/ZB;

fprintf('Матрица с проводимостите на мрежата')
Y

% Извличаме нейните подматрици и с тях изчисляваме
% редуцираната матрица с проводимостите на мрежата,
% в която присъстват само възли 1 и 2
bus_G = [1 2];
bus_B = [3 4];
fprintf('И нейните подматрици')
YGG = Y(bus_G, bus_G)
YGB = Y(bus_G, bus_B)
YBG = Y(bus_B, bus_G)
YBB = Y(bus_B, bus_B)

fprintf('Редуцираната матрица с възловите проводимости е')
YG = YGG - YGB*inv(YBB)*YBG

% От редуцираната матрица извличаме собствените и взаимни
% проводимости на двата генераторни клона
% Собствени проводимости
fprintf('Собствени проводимости:\n')
Y11 = YG(1,1);
fprintf('Y11  = %0.4f %+0.4fi \n', real(Y11), imag(Y11))
Y22 = YG(2,2);
fprintf('Y22  = %0.4f %+0.4fi \n', real(Y22), imag(Y22))

% Взаимни проводимости
fprintf('Взаимни проводимости:\n')
Y12 = -YG(1,2);
fprintf('Y12  = %0.4f %+0.4fi \n', real(Y12), imag(Y12))
Y21 = -YG(2,1);
fprintf('Y21  = %0.4f %+0.4fi \n', real(Y21), imag(Y21))